# Observation with Pandas

#### loc & iloc

In [22]:
import numpy as np

In [23]:
import pandas as pd

In [3]:
m = np.random.randint(1, 30, size = (10, 3))
df = pd.DataFrame(m, columns = ["var1", "var2", "var3"])
df

   var1  var2  var3
0    16    23     2
1    26     9    13
2    23     8     1
3    17    13    12
4    13    28    21
5    24    15     6
6     1    27     4
7     8     3    26
8    25     8     6
9    22    23    27

### loc: using for making choices

In [5]:
df.loc[0:3]

   var1  var2  var3
0    16    23     2
1    26     9    13
2    23     8     1
3    17    13    12

### iloc: using for making choices that we are used to

In [8]:
df.iloc[0:3]

   var1  var2  var3
0    16    23     2
1    26     9    13
2    23     8     1

In [13]:
df.iloc[0:3, 0:2]

   var1  var2
0    16    23
1    26     9
2    23     8

In [17]:
df.loc[0:3, "var3"]

0     2
1    13
2     1
3    12
Name: var3, dtype: int32

In [21]:
df.iloc[0:3]["var3"]

0     2
1    13
2     1
Name: var3, dtype: int32